print('Lesson 4_2:')

import random

# по условию задачи не понял, генератор использовать для формирования исходного списка или для результирующего
# написал оба варианта

# вариант решения 1 - генератор используем для формирования исходного списка

source_list = [random.randint(1, 300) for n in range(1, 25)]  # генерируем случайную последовательность

result_list = []
for i in range(1, len(source_list) - 1):  # выводим элементы, значения которых больше предыдущего
    if source_list[i - 1] < source_list[i]:
        result_list.append(source_list[i])

print('Исходный список:', *source_list)
print('Результат:', *result_list)

# --------------------------------------------------------------------
# вариант решения 2 - генератор используем для формирования результирующего списка

source_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55, 116, 48, 211, 55, 3, 12, 199, 208, 106, 36, 228, 101]
result_list = [source_list[i] for i in range(1, len(source_list) - 1) if source_list[i - 1] < source_list[i]]

print('-' * 20 + '\nИсходный список:', *source_list)
print('Результат:', *result_list)
