print('Lesson 1_4')

while True:
    n = input("Enter number n (1 - 9999999999): ")

    # валидация ввода
    # если в n не цифры, то до int(n) выполнение не дойдет и ошибка не возникнет
    if n.isdigit() and 1 <= int(n) <= 9999999999:

        n = int(n)  # введенную строку теперь можно безопасно превратить в число
        max = 1  # переменная для хранения максимума

        while n != 0:  # пока n содержит цифры, отличные от нуля - проверяем правую цифру
            if max < n % 10:  # при необходимости
                max = n % 10  # обновляем максимум
            n = n // 10  # отсекаем правую цифру

        print('Max digit is', max)  # вывод результата
        break

    # конец валидации ввода
    else:
        print('Invalid input. Retype')
        continue
